import { Component, OnInit } from '@angular/core';
import { ActivatedRoute } from '@angular/router';
import { AccountService } from 'src/app/services/account.service';
import { BreadcrumbService } from 'src/app/services/breadcrumb.service';
import { WrapperFuncService } from 'src/app/services/wrapper-func.service';
import { WrapperSearchService } from 'src/app/services/wrapper-search.service';

@Component({
  selector: 'app-fqa',
  templateUrl: './fqa.component.html',
  styleUrls: ['./fqa.component.scss']
})
export class FQAComponent implements OnInit {

  constructor(public breadcrumbService: BreadcrumbService,
    public _acct: AccountService,
    public _activatedRoute: ActivatedRoute,
    public _funcService: WrapperFuncService,
    private _wrapperSearchService: WrapperSearchService,) {
    this._acct.globalStateChanged.subscribe((state) => {
      this._wrapperSearchService.LoginStatus$.next(state.loggedInStatus);
    });
    this._wrapperSearchService.Username$ = this._acct.currentUserName;
    this._wrapperSearchService.HomePage$.next(false);
    this.breadcrumbService.setItem([
      { label: 'דף הבית', routerLink: ['/'] },
      { label: 'שאלות ותשובות', routerLink: ['/FQA'] }
    ]);
  }
  questions= [
    {
      q: "איך נרשמים לאתר?",
      a: `לוחצים על הלחצן 'חדשה כאן? הצטרפי' רצוי להירשם דרך ג'ימייל. הכי פשוט וקל.
      מוזמנת לצפות גם בווידאו ההסבר.`
    },
    {
      q: "נרשמתי ולא קיבלתי מייל",
      a: `יש להמתין כעשר שניות לשליחת מייל האימות. 
      חפשי בספאם, בקידומי מכירות וכדומה. 
      אם עדיין לא קיבלת - לחצי על שליחת מייל חוזרת. 
      מוזמנת לצפות גם בווידאו ההסבר. `
    },
    {
      q: "איך מתחברים?",
      a: `לוחצים על הלחצן 'התחברי'. 
      רצוי להתחבר דרך ג'ימייל. הכי פשוט וקל. 
      מוזמנת לצפות גם בווידאו ההסבר.
      `
    },
    {
      q: "אני עצמאית, איך יוצרים כרטיס עסק? ",
      a: `מעלים לוגו, כותבים את שם העסק והסלוגן שלך, מעלים תמונות מהעסק או מודעות שיש לך, 
      מוסיפים פרטי קשר: מ
      
      
      
      
      ייל ולינק לתיק עבודות/לאתר
      כותבים טקסט שמסביר מה בדיוק את עושה ולמי את עוזרת, 
      בוחרים קטגוריה ותת-קטגוריה המתאימות לך, 
      מציינים אם תרצי עסקאות בתשלום/ברטר/שת"פ
      ולוחצים על הלחצן הוורוד של 'סיימתי, עדכנו את כרטיס העסק שלי'
      מוזמנת לצפות גם בווידאו ההסבר.`
    },
    {
      q: "אני עצמאית, איך משנים פרטים בכרטיס העסק?",
      a: `את לוחצת על המילה 'שלום' שלידה משולש קטן, 
      ואז לוחצת על המילים 'לכרטיס העסק שלך'
      `
    },
    // {
    //   q: "איך אני שולחת הודעה פרטית למישהי שרשומה כאן באתר?",
    //   a: `את נכנסת לכרטיס העסק ולוחצת על 'שלחי הודעה מידית'
    //   אם את לא רואה מיד את כרטיס העסק -
    //   את לוחצת על 'מצאי שת"פ' ואז מחפשת את שם העסק,
    //   נכנסת לכרטיס שלה, ושם לוחצת על 'שלחי הודעה מידית'.`
    // },
    // {
    //   q: "איך אני רואה הודעות פרטיות ששלחו לי?",
    //   a: `את לוחצת על סמל המעטפה שלצד המילה 'שלום'`
    // },
    // {
    //   q: `איך אני יודעת עם מי לעשות שת"פ?`,
    //   a: `מומלץ לחשוב מה סוג העסק שיכול להרוויח מזה שתציעי לו שת"פ, 
    //   ואז את לוחצת על 'מצאי שת"פ', מחפשת את הקטגוריה הרלוונטית לך,
    //   נכנסת לכרטיסי העסק, בודקת מה הכי נראה לך, ולוחצת על 'שלחי הודעה מידית'.
    //   בהודעה תפרטי מה את עושה, מה הצד השני ירוויח משת"פ איתך, ומה את מחפשת לקבל.`
    // },
    {
      q: `איך לעשות שת"פ שישתלם לי?`,
      a: `מומלץ לחשוב מה סוג העסק שיכול להרוויח מזה שתציעי לו שת"פ, 
      ואז את לוחצת על 'אינדקס העסקים',
      מחפשת את הקטגוריה הרלוונטית לך או נכנסת לכרטיסי העסק אחד-אחד, בודקת מה הכי נראה לך, ולוחצת על 'שלחי הודעה'.
      בהודעה תפרטי מה את עושה, מה הצד השני ירוויח משת"פ איתך, ומה את מחפשת לקבל.
      חשוב שתגדירי לעצמך באופן ברור ומדיד מה הציפיות שלך משיתוף הפעולה. כך תוכלי לדעת למי לפנות 
      ומה להציע לה, וגם יתאפשר לך למדוד האם שיתוף הפעולה הועיל. לדוגמה: להצליח להביא מתעניינים = לא מדיד. להצליח להביא
      50 מתעניינים = מדיד. אחרי שיש ציפיות מוגדרות - נשאר לבחון את תוצאות השת"פ כדי לדעת האם שווה לעשות זאת שוב.`
    },
    {
      q: "איך אפשר למצוא עסק ספציפי?",
      a: `את לוחצת על 'מצאי שת"פ' (בדף הבית או בתפריט העליון) 
      ואז מחפשת את שם העסק או את הקטגוריה הרלוונטית לך.`
    },
    // {
    //   q: `איך לוודא שבאמת השת"פ שאציע - ישתלם לי?`,
    //   a: `מומלץ להגדיר באופן ברור ומדיד מה הציפיות. 
    //   לדוגמה:
    //   להצליח להביא מתעניינים = לא מדיד.
    //   להצליח להביא 100 מתעניינים = מדיד.
    //   אחרי שיש ציפיות מוגדרות - נשאר לבדוק מה התוצאות מהשת"פ.`
    // },
    {
      q: `אני שכירה, איך אתר תמך יכול לעזור לי?`,
      a: `יש לך את לוח המודעות שבו תוכלי לפרסם בקשה לעזרה הקשורה לעיסוק שלך
        או הצעה להיעזר בך במסגרת שיתוף פעולה, בתשלום או בכל דרך אחרת. בנוסף, יש לך את הדף לשכירה
        שבו מפורטות פעילות תמך לשכירה: הכשרה מקצועית, 
        קורסי העשרה וגם השמה.`
    },
    {
      q: `איך אני מצטרפת לרשומות באלפון קהילת תמך?`,
      a: `אין צורך בפעילות מיוחדת מלבד הרשמה לאתר.
        עם הרשמתך, הפרטים שתכניסי יופיעו
        באלפון ויאפשרו לשאר המשתתפות בקהילת תמך ליצור איתך קשר. `
    },
  ];
  ngOnInit(): void {
    console.log(this.questions);
    
  }

}
